lugondev/esp32-assistant/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Default 512 bytes is too small for real phone browsers hitting the
# provisioning captive portal (headers exceed it → HTTP 431).
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# Default 2304 overflows once on_event() calls display_show()/voice_play()
# (SPI/I2S) from the system event task.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192

CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
